package org.example.engineeringsocialnetwork.entities;

import lombok.experimental.UtilityClass;

@UtilityClass
@SuppressWarnings({"LineLength", "RegexpSingleline"})
public class Info {
    public final static String MAIN_INFO = """
            Комплексная платформа, которая поможет инженерам и предприятиям ориентироваться в мире
            технологий информационного моделирования: от поиска идеи и общения до создания объекта
            """;
    public final static String LEGAL_INFORMATION = """
            +7 (342) 298 86 86
            единый контактный номер телефона
            Образовательные услуги оказываются АНО ДПО «ПРОТИМ» на основании Лицензии № Л035-01212-59/01093018 от 14 марта 2024
            
            
            Документ о прохождении обучения по программе дополнительного профессионального образования также выдаётся АНО ДПО «ПРОТИМ»
            
            
            Проект компании «Кайрос Инжиниринг»
            
            
            © 2024 АНО ДПО «ПРОТИМ», ООО «Кайрос Инжиниринг». Г. Пермь, ул. Максима Горького, 34
            """;
}
